---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewError
source: html/05c238eb-1155-a6ad-f9d3-2d307a8fa27a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InsertColumnViewError Property

Column cannot be placed in Elevation or Section view

## Syntax (C#)
```csharp
public static FailureDefinitionId InsertColumnViewError { get; }
```